scripts/exp2/redis-sls-10-04.txt
====== PING_INLINE ======
  100000 requests completed in 9.49 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 0.3 milliseconds
0.28% <= 0.4 milliseconds
2.47% <= 0.5 milliseconds
8.55% <= 0.6 milliseconds
18.00% <= 0.7 milliseconds
28.24% <= 0.8 milliseconds
35.33% <= 0.9 milliseconds
37.70% <= 1.0 milliseconds
38.10% <= 1.1 milliseconds
38.52% <= 1.2 milliseconds
39.59% <= 1.3 milliseconds
41.70% <= 1.4 milliseconds
43.95% <= 1.5 milliseconds
46.31% <= 1.6 milliseconds
48.73% <= 1.7 milliseconds
51.14% <= 1.8 milliseconds
53.57% <= 1.9 milliseconds
55.97% <= 2.0 milliseconds
58.31% <= 2.1 milliseconds
58.31% <= 2 milliseconds
70.03% <= 3 milliseconds
70.12% <= 4 milliseconds
70.19% <= 5 milliseconds
71.07% <= 6 milliseconds
78.01% <= 7 milliseconds
87.22% <= 8 milliseconds
88.07% <= 9 milliseconds
88.12% <= 10 milliseconds
88.17% <= 11 milliseconds
90.80% <= 12 milliseconds
93.76% <= 13 milliseconds
93.83% <= 14 milliseconds
93.85% <= 16 milliseconds
94.07% <= 17 milliseconds
94.90% <= 18 milliseconds
94.98% <= 19 milliseconds
95.02% <= 20 milliseconds
95.05% <= 21 milliseconds
96.55% <= 22 milliseconds
99.80% <= 23 milliseconds
99.95% <= 37 milliseconds
99.97% <= 38 milliseconds
99.98% <= 39 milliseconds
100.00% <= 39 milliseconds
10537.41 requests per second

====== PING_BULK ======
  100000 requests completed in 9.64 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

38.74% <= 1 milliseconds
56.66% <= 2 milliseconds
69.26% <= 3 milliseconds
69.31% <= 4 milliseconds
69.31% <= 5 milliseconds
70.25% <= 6 milliseconds
77.02% <= 7 milliseconds
86.99% <= 8 milliseconds
87.71% <= 9 milliseconds
87.72% <= 10 milliseconds
87.78% <= 11 milliseconds
90.29% <= 12 milliseconds
93.13% <= 13 milliseconds
93.16% <= 14 milliseconds
93.19% <= 15 milliseconds
93.20% <= 16 milliseconds
93.74% <= 17 milliseconds
94.47% <= 18 milliseconds
94.61% <= 19 milliseconds
94.67% <= 20 milliseconds
94.69% <= 21 milliseconds
96.35% <= 22 milliseconds
99.75% <= 23 milliseconds
99.99% <= 25 milliseconds
100.00% <= 25 milliseconds
10378.83 requests per second

====== SET ======
  100000 requests completed in 9.68 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

38.07% <= 1 milliseconds
55.46% <= 2 milliseconds
68.86% <= 3 milliseconds
68.93% <= 4 milliseconds
68.95% <= 5 milliseconds
69.64% <= 6 milliseconds
77.17% <= 7 milliseconds
86.94% <= 8 milliseconds
87.66% <= 9 milliseconds
87.77% <= 10 milliseconds
87.80% <= 11 milliseconds
90.31% <= 12 milliseconds
93.46% <= 13 milliseconds
93.53% <= 14 milliseconds
93.55% <= 15 milliseconds
93.57% <= 16 milliseconds
93.63% <= 17 milliseconds
94.54% <= 18 milliseconds
94.78% <= 19 milliseconds
94.83% <= 20 milliseconds
94.88% <= 21 milliseconds
96.42% <= 22 milliseconds
99.92% <= 23 milliseconds
100.00% <= 23 milliseconds
10332.71 requests per second

====== GET ======
  100000 requests completed in 9.32 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

38.65% <= 1 milliseconds
55.56% <= 2 milliseconds
69.36% <= 3 milliseconds
69.51% <= 4 milliseconds
69.52% <= 5 milliseconds
70.33% <= 6 milliseconds
78.53% <= 7 milliseconds
87.38% <= 8 milliseconds
88.20% <= 9 milliseconds
88.26% <= 10 milliseconds
88.29% <= 11 milliseconds
91.13% <= 12 milliseconds
94.75% <= 13 milliseconds
94.98% <= 15 milliseconds
94.99% <= 16 milliseconds
95.17% <= 17 milliseconds
95.61% <= 18 milliseconds
95.68% <= 19 milliseconds
95.71% <= 20 milliseconds
95.74% <= 21 milliseconds
96.98% <= 22 milliseconds
99.72% <= 23 milliseconds
99.95% <= 31 milliseconds
99.96% <= 32 milliseconds
99.99% <= 33 milliseconds
100.00% <= 33 milliseconds
10730.76 requests per second

====== INCR ======
  100000 requests completed in 9.27 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

39.70% <= 1 milliseconds
56.57% <= 2 milliseconds
69.81% <= 3 milliseconds
69.89% <= 4 milliseconds
69.89% <= 5 milliseconds
70.64% <= 6 milliseconds
77.80% <= 7 milliseconds
87.05% <= 8 milliseconds
87.98% <= 9 milliseconds
88.08% <= 10 milliseconds
88.14% <= 11 milliseconds
91.21% <= 12 milliseconds
94.95% <= 13 milliseconds
95.15% <= 14 milliseconds
95.16% <= 16 milliseconds
95.18% <= 17 milliseconds
95.49% <= 18 milliseconds
95.60% <= 19 milliseconds
95.61% <= 20 milliseconds
95.61% <= 21 milliseconds
96.97% <= 22 milliseconds
99.89% <= 23 milliseconds
100.00% <= 23 milliseconds
10789.81 requests per second

====== LPUSH ======
  100000 requests completed in 12.40 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

19.33% <= 1 milliseconds
43.76% <= 2 milliseconds
65.04% <= 3 milliseconds
66.24% <= 4 milliseconds
68.36% <= 5 milliseconds
69.63% <= 6 milliseconds
73.39% <= 7 milliseconds
74.79% <= 8 milliseconds
74.94% <= 9 milliseconds
74.95% <= 10 milliseconds
74.96% <= 11 milliseconds
76.55% <= 12 milliseconds
79.90% <= 13 milliseconds
80.61% <= 14 milliseconds
83.29% <= 15 milliseconds
86.86% <= 16 milliseconds
93.91% <= 17 milliseconds
97.55% <= 18 milliseconds
97.86% <= 19 milliseconds
97.86% <= 20 milliseconds
97.88% <= 21 milliseconds
98.15% <= 22 milliseconds
99.30% <= 23 milliseconds
99.96% <= 24 milliseconds
99.96% <= 25 milliseconds
99.97% <= 26 milliseconds
100.00% <= 26 milliseconds
8065.82 requests per second

====== RPUSH ======
  100000 requests completed in 10.04 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

16.62% <= 1 milliseconds
46.68% <= 2 milliseconds
70.95% <= 3 milliseconds
74.97% <= 4 milliseconds
81.16% <= 5 milliseconds
82.10% <= 6 milliseconds
82.66% <= 7 milliseconds
82.83% <= 10 milliseconds
82.85% <= 11 milliseconds
84.21% <= 12 milliseconds
88.15% <= 13 milliseconds
88.88% <= 14 milliseconds
92.28% <= 15 milliseconds
93.94% <= 16 milliseconds
95.41% <= 17 milliseconds
96.28% <= 18 milliseconds
96.32% <= 19 milliseconds
96.32% <= 20 milliseconds
96.34% <= 21 milliseconds
96.97% <= 22 milliseconds
98.57% <= 23 milliseconds
99.92% <= 24 milliseconds
99.93% <= 28 milliseconds
99.95% <= 31 milliseconds
99.97% <= 32 milliseconds
99.99% <= 33 milliseconds
100.00% <= 33 milliseconds
9961.15 requests per second

====== LPOP ======
  100000 requests completed in 8.58 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

13.80% <= 1 milliseconds
44.08% <= 2 milliseconds
71.81% <= 3 milliseconds
78.59% <= 4 milliseconds
86.68% <= 5 milliseconds
87.63% <= 6 milliseconds
87.64% <= 8 milliseconds
87.65% <= 9 milliseconds
87.72% <= 10 milliseconds
87.82% <= 11 milliseconds
90.14% <= 12 milliseconds
96.37% <= 13 milliseconds
97.46% <= 14 milliseconds
97.70% <= 15 milliseconds
97.72% <= 16 milliseconds
97.74% <= 17 milliseconds
97.75% <= 18 milliseconds
97.75% <= 19 milliseconds
97.75% <= 20 milliseconds
97.78% <= 21 milliseconds
98.13% <= 22 milliseconds
99.68% <= 23 milliseconds
99.99% <= 24 milliseconds
100.00% <= 24 milliseconds
11660.45 requests per second

====== RPOP ======
  100000 requests completed in 3.45 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

87.85% <= 1 milliseconds
92.04% <= 2 milliseconds
95.98% <= 3 milliseconds
97.06% <= 4 milliseconds
98.08% <= 5 milliseconds
98.32% <= 6 milliseconds
98.32% <= 8 milliseconds
98.37% <= 11 milliseconds
98.88% <= 12 milliseconds
99.80% <= 13 milliseconds
99.85% <= 22 milliseconds
99.95% <= 23 milliseconds
100.00% <= 23 milliseconds
29002.32 requests per second

====== SADD ======
  100000 requests completed in 2.66 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.85% <= 1 milliseconds
100.00% <= 1 milliseconds
37551.63 requests per second

====== HSET ======
  100000 requests completed in 2.67 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.68% <= 1 milliseconds
99.90% <= 2 milliseconds
99.96% <= 3 milliseconds
99.99% <= 4 milliseconds
100.00% <= 4 milliseconds
37509.38 requests per second

====== SPOP ======
  100000 requests completed in 2.65 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.92% <= 1 milliseconds
100.00% <= 1 milliseconds
37693.18 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 2.66 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.67% <= 1 milliseconds
99.89% <= 2 milliseconds
99.93% <= 3 milliseconds
99.97% <= 4 milliseconds
100.00% <= 5 milliseconds
37523.45 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 3.29 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

91.42% <= 1 milliseconds
100.00% <= 1 milliseconds
30367.45 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 5.42 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
99.85% <= 2 milliseconds
99.94% <= 3 milliseconds
99.98% <= 4 milliseconds
100.00% <= 4 milliseconds
18456.99 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 7.02 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
98.71% <= 2 milliseconds
99.84% <= 3 milliseconds
99.90% <= 4 milliseconds
99.94% <= 5 milliseconds
99.96% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 8 milliseconds
14236.90 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 7.94 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
56.15% <= 2 milliseconds
99.92% <= 3 milliseconds
99.95% <= 4 milliseconds
99.97% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 6 milliseconds
12594.46 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 2.74 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.11% <= 1 milliseconds
99.95% <= 2 milliseconds
99.97% <= 3 milliseconds
99.98% <= 4 milliseconds
99.99% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 6 milliseconds
36496.35 requests per second